---
kind: property
id: P:Autodesk.Revit.UI.ExternalApplicationArray.Item(System.Int32)
source: html/431c2e81-f85b-9b8f-65dd-4d3a2a8b678b.htm
---
# Autodesk.Revit.UI.ExternalApplicationArray.Item Property

Gets or sets an item at a specified index within the array.

## Syntax (C#)
```csharp
public virtual IExternalApplication this[
	int index
] { get; set; }
```

## Parameters
- **index** (`System.Int32`) - The index of the item to be set or retrieved.

## Returns
Returns the object at the specified index.